const text =
  'В Потрібні два викладача на філіали: Мінський масив та Позняки. Також проводимо набір інструкторів. Вимоги: наявність категорії «В» більше 3-х років; вища освіта; інтелігентність, комунікабельність, бажання вчити та працювати на результат; досвід роботи від двох років; без досвіду роботи, але з готовністю навчатись; викладання українською мовою. Умови роботи: оплата за кожну групу в 1−2 етапи за домовленістю; оплата за групу — 8000 грн; для кожної групи заняття проводяться 2 рази на тиждень по 3 години, або один раз на тиждень 5 годин протягом 5−6 нед. готовність працювати в робочі та вихідні дні. Вихідні дні у викладача — в залежності від графіка наявних груп. Обов’язки: теоретична підготовка клієнтів для отримання посвідчення водія на категорію «В»';

const textArr = [
  text,
  `Вже більше 70 років «Укрнафта» є найбільшою нафтогазовидобувною компанією України, в складі якої перебувають 1791 нафтових та 147 газових свердловин, а також більше 500 монобрендові АЗС UKRNAFTA майже в усіх регіонах України.

Все це можливо завдяки людям, які працюють в нашій команді — сильним, відважним, рішучим, інноваційним та об'єднаним спільною метою. Велика родина #UkrnaftaPeople налічує майже 20 000 колег по всій Україні, запрошуємо стати частиною нашої команди «Керівника/Керівницю відділу системного програмного забезпечення».

З нами ви отримаєте:

офіційне працевлаштування у найбільшій нафтовидобувній компанії країни;
своєчасну виплату заробітної плати на конкурентному рівні;
оплачувану щорічну (24-і дні) та додаткова (до 7-і днів) відпустку;
лікарняний та медичне страхування (організація невідкладної допомоги, медикаментозне забезпечення, огляди в державних та приватних клініках та інше);
програму лояльності для всіх співробітників зі знижками на пальне, товари магазинів та кава-корнерів АЗС;
мат. допомога до відпустки з 2-го року роботи та у різних життєвих обставинах, виплата до професійного свята та мобілізованим співробітникам;
гібридний графік роботи;
затишне та смачне кафе на території офісу;
комфортний офіс в центрі міста, з обладнаним сховищем та генератором;
корпоративні знижки в мережах спортклубів CrossFIT Banda та Sport Life, а також у мережі хімчисток UNMOMENTO.
Вашими основними завданнями будуть:

Ми очікуємо від вас:

вищу освіту в сфері IT;
досвід роботи за напрямком від 5 років, на керівних посадах від 2 років;
поглиблені знання та практичний досвід роботи з продуктами Microsoft (Hyper-V, System Center VMM, SCCM, Exchange), VMWare (vCenter);
відмінні знання ОС Windows Server 2019−2022 (AD DS, DNS, DHCP, GPO, PKI, FS, RDS);
знання основних мережевих технологій та протоколів: DNS, DHCP, SMTP, FTP, модель OSI, стек TCP/IP;
досвід роботи з хмарними сервісами: Microsoft Azure, Office365, Intune, Endpoint Protection;
досвід роботи з серверним обладнанням HPE, Dell або аналогічним;
досвід роботи з системами моніторингу (Zabbix);
бажаний досвід впровадження систем моніторингу, резервного копіювання, проектів міграції з використанням хмарних сервісів Azure, AWS або провайдерів послуг (Private Cloud);
бажаний досвід автоматизації процесів (Powershell), знання процесів CI/CD;
стресостійкість;
впорядковані документи, а саме наявний військово-обліковий документ згідно діючого законодавства, паспорт (непротермінований) та інші.`,
  `Європейська медична лабораторія «Cінево Україна», що входить у шведську групу компаній медичного холдингу «Medicover», запрошує приєднатись до команди Спеціаліста технічної підтримки ІТ відділу.

Основні обов’язки:

прийом та сортування заявок;
вирішення заявок першого рівня підтримки;
щоденний збір звернень користувачів лабораторії та офісу, реєстрація їх звернень, вирішення цих заявок;
відслідковування статусів заявок другого рівня і комунікація з адміністраторами;
контроль термінів виконання заявок;
написання інструкцій для користувачів;
комунікація з користувачами;
налагодження ПО та периферії;
відслідковування статусів сервісів та пристроїв на моніторингу Zabbix та Dude;
відслідковування статусів установки оновлень WSUS.
Для нас важливо, щоб Ви:

вміли встановлювати та підтримувати ОС Windows 7, 8, 10;
вміли налаштовувати та підтримувати пристрої периферії;
вміли управляти користувачами в AD;
мали навички з WSUS (моніторинг та застосування оновлень);
мали хороші комунікативні навички;
вміли працювати в команді.
Ми надаємо:

Стабільність. Робота у великій драйвовій та провідній європейській компанії.
Комфортне місце роботи. Сучасний офіс поруч зі ст. метро Академмістечко.
Нормований графік роботи. З 09:00 до 18:00 СБ та НД — вихідні.
Гідну оплату праці. Стабільна заробітна плата — два рази на місяць.
Перегляд заробітної плати щороку.
Офіційне працевлаштування. Оформлення з першого робочого дня; оплачувана щорічна відпустка — 24 календарних дні на рік.
Ми піклуємося про здоров’я своїх співробітників. Надаємо знижки на аналізи для Вас і вашої родини.
Професійний розвиток. Ми оплачуємо навчальні курси та програми для всіх працівників.
Приєднуйтесь до нашої великої команди Сінево!`,
];

export default text;
export { textArr };
