import VacancyCardList from '~/components/VacancyCardList';
import Container from '~/components/Container';
import VacancyInfo from './VacancyInfo';

const data = [
  {
    id: 2,
    title: 'Логіст',
    description: `Досвід роботи
    Логіст
    з 01.2016 по нині (8 років 3 місяці)
    Транспорт, логістика
    
    Освіта
    КУТЕП
    Готельно-ресторанний бізнес, Київ
    Вища, з 2014 по 2018 (4 роки)
    
    ЕЮУ при КУТЕП
    Туризм, Київ
    Середня спеціальна, з 2011 по 2014 (3 роки)
    
    Знання і навички
    Здатність до навчання
    Організація внутрішніх перевезень
    Ларді-Транс
    Della
    Розрахунок тарифів перевезень
    Комунікабельність
    Самостійне прийняття рішень
    Організація міжнародних перевезень
    Організація автоперевезень`,
    salary: 20000,
    experience: 8,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'повна' as const,
    ratingScore: 78,
    badges: ['Співпідіють зарплатні очікування', 'Рівень освіти: бакалавр', 'Досвід роботи 8 років'],
  },
  {
    id: 1,
    title: 'Менеджер з логістики',
    description: `Досвід роботи:
    03.2016 — 10.2016
    Адміністратор • Готель «Ark Spa Palace»
    10.2016 — 01.2017
    Секретар • ТОВ «Юнімар Логістік»
    02.2017 — 05.2018
    Помічник логіста з морських та жд перевезень • ТОВ «Інтерлайнер Едженсіз»
    06.2018 — 11.2023
    Мееджер з авіа та частково авто перевезень • ТОВ «Інтерлайнер Едженсіз»
    Контроль взаєморозрахунків, робота з документами, контроль вантажних перевезень на всіх етапах від завантаження до розвантаження, пошук найманого транспорту, укладання довгострокових договір із перевізниками, внесення інформації стосовно угод у програму 1С, часткове внесення рахунків в 1С.
    Освіта
    Одеський Морський Національний Університет, Одеса, Україна
    ФТТС, з 2014 по 2018 рік
    Знання і навички
    • MS Office, 1С, Зосередженість, Комунікабельність, Відповідальність, Старанність, Пунктуальність.
    Знання мов:
    Англійська – початкова,
    Українська – просунута
    Російська - вільно`,
    salary: 12000,
    experience: 3,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'неповна' as const,
    ratingScore: 67,
    badges: ['Співпідіють зарплатні очікування', 'Рівень освіти: бакалавр'],
  },
];

const vacancy = {
  id: 2,
  title: 'Логіст, менеджер з транспортної логістики',
  description: `Ми, компанія MORITAN, готові Тобі це запропонувати. У нас є досвід, класні люди, крута схема мотивації. Ми цінуємо знання, ми надаємо можливості, ми — команда, яка працює на результат!

  Однією з наших стратегічних цілей на 2024 рік є розвиток компанії, а тому, ми потребуємо підсилення в команді. В даний час шукаємо людину, з досвідом у сфері логістики або іншій сфері прямої комунікації. Якщо це Ти — тоді надсилай своє резюме!
  
  Чим ми займаємось?
  Організація внутрішніх та міжнародних перевезень усіх типів вантажів;
  Робота з контрагентами по забезпеченню їх транспортом та підтримання ділових відносин на довгострокову перспективу;
  Оперативний пошук транспорту для перевезення вантажів та підтримування ділових відносин з перевізником;
  Контроль перевезення вантажу на усіх етапах;
  Документальний супровід.

  Що нам важливо у тобі в межах цієї позиції?
  Досвіду в побудові та розвитку тривалих відносин з клієнтами та партнерами;
  Вміння домовлятись та будувати довготермінові партнерські відносини;
  Відповідальність, чіткість і послідовність в роботі;
  Логічне мислення та комунікабельність та порядність;
  Здатність працювати самостійно та одночасно бути продуктивним командним гравцем.

  Що ми пропонуємо?
  Офіційне працевлаштування;
  Підтримку в навчанні та плачуваний період стажування;
  Ставка + відсоток або великий % на вибір!
  Прозоре нарахування заробітної плати, вчасну її виплату;
  Графік роботи (пн-чт) 9:00—18:00, (пт) 9:00—17:00.

  Що ти прокачаєш?
  Навички будуватимеш стратегічні відносини з партнерами;
  Командну роботу. Ми знаємо, що створення якісних проектів, можливо лише в тісній співпраці всередині компанії;
  Вміння швидко занурюватися в проблему та знаходити рішення.`,
  salary: 20000,
  experience: 5,
  education: 'бакалавр' as const,
  location: 'Київ, вулиця Промислова, 40',
  contract: 'повна' as const,
};

const VacancyPage = () => {
  return (
    <Container>
      <VacancyInfo vacancy={vacancy} />
      <VacancyCardList vacancies={data} title={'Рекомендовані резюме'} />
    </Container>
  );
};

export default VacancyPage;
