const educationOptions = [
  {
    label: 'Базова середня освіта',
    value: 'базова середня освіта',
  },
  {
    label: 'Повна загальна середня освіта',
    value: 'повна загальна середня освіта',
  },
  {
    label: 'Спеціальна середня освіта',
    value: 'спеціальна середня освіта',
  },
  {
    label: 'Бакалаврський рівень вищої освіти',
    value: 'бакалаврський рівень вищої освіти',
  },
  {
    label: 'Магістерський рівень вищої освіти',
    value: 'магістерський рівень вищої освіти',
  },
  {
    label: 'Освітньо-науковий/освітньо-творчий рівень вищої освіти',
    value: 'освітньо-науковий/освітньо-творчий рівень вищої освіти',
  },
  {
    label: 'Науковий рівень вищої освіти',
    value: 'науковий рівень вищої освіти',
  },
];

export default educationOptions;
