import VacancyCardList from '~/components/VacancyCardList';
import Container from '~/components/Container';

const data = [
  {
    id: 1,
    title: 'Логіст',
    description: `Компанія «Тропік», яка активно та стабільно працює на ринку продажів імпортних фруктів та овочів, запрошує на роботу логіста.
  
    Вимоги:
    
    освіта — вища, незакінчена вища;
    досвід роботи логістом від 1 року;
    знання транспортної документації;
    знання міста і області;
    вільне володіння MS office, знання 1С, логістичних програм.
    Обов’язки:
    
    створення оптимальних маршрутів для доставлення продукції до торгових точок по місту Київ, області та сусідніх областей;
    контроль руху транспорту;
    постійний зв’язок з водієм та контроль його дій на маршруті;
    створення бази перевізників;
    моніторинг вартості перевезень, формування ціноутворення і собівартості перевезень;
    ведення звітності по перевезеннях.
    Ми пропонуємо:
    
    роботу в стабільній компанії;
    вчасну виплату заробітної плати (два рази в місяць);
    перспективу кар'єрного росту;
    офіційне працевлаштування.`,
    salary: 20000,
    experience: 1,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'повна' as const,
  },
  {
    id: 2,
    title: 'Логіст',
    description: `Компанія «Тропік», яка активно та стабільно працює на ринку продажів імпортних фруктів та овочів, запрошує на роботу логіста.
  
    Вимоги:
    
    освіта — вища, незакінчена вища;
    досвід роботи логістом від 1 року;
    знання транспортної документації;
    знання міста і області;
    вільне володіння MS office, знання 1С, логістичних програм.
    Обов’язки:
    
    створення оптимальних маршрутів для доставлення продукції до торгових точок по місту Київ, області та сусідніх областей;
    контроль руху транспорту;
    постійний зв’язок з водієм та контроль його дій на маршруті;
    створення бази перевізників;
    моніторинг вартості перевезень, формування ціноутворення і собівартості перевезень;
    ведення звітності по перевезеннях.
    Ми пропонуємо:
    
    роботу в стабільній компанії;
    вчасну виплату заробітної плати (два рази в місяць);
    перспективу кар'єрного росту;
    офіційне працевлаштування.`,
    salary: 20000,
    experience: 1,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'повна' as const,
  },
];

const Home = () => {
  return (
    <Container>
      <VacancyCardList vacancies={data} />
    </Container>
  );
};

export default Home;
