import VacancyCardList from '~/components/VacancyCardList';
import Container from '~/components/Container';
import VacancySearch from '~/components/VacancySearch/VacancySearch';
// import VacancyFilters from '~/components/VacancySearch/VacancyFilters';

const data = [
  {
    id: 1,
    title: 'Логіст',
    description: `Компанія «Тропік», яка активно та стабільно працює на ринку продажів імпортних фруктів та овочів, запрошує на роботу логіста.
  
    Вимоги:
    
    освіта — вища, незакінчена вища;
    досвід роботи логістом від 1 року;
    знання транспортної документації;
    знання міста і області;
    вільне володіння MS office, знання 1С, логістичних програм.
    Обов’язки:
    
    створення оптимальних маршрутів для доставлення продукції до торгових точок по місту Київ, області та сусідніх областей;
    контроль руху транспорту;
    постійний зв’язок з водієм та контроль його дій на маршруті;
    створення бази перевізників;
    моніторинг вартості перевезень, формування ціноутворення і собівартості перевезень;
    ведення звітності по перевезеннях.
    Ми пропонуємо:
    
    роботу в стабільній компанії;
    вчасну виплату заробітної плати (два рази в місяць);
    перспективу кар'єрного росту;
    офіційне працевлаштування.`,
    salary: 15000,
    experience: 1,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'повна' as const,
  },
  {
    id: 2,
    title: 'Логіст, менеджер з транспортної логістики',
    description: `Ми, компанія MORITAN, готові Тобі це запропонувати. У нас є досвід, класні люди, крута схема мотивації. Ми цінуємо знання, ми надаємо можливості, ми — команда, яка працює на результат!

    Однією з наших стратегічних цілей на 2024 рік є розвиток компанії, а тому, ми потребуємо підсилення в команді. В даний час шукаємо людину, з досвідом у сфері логістики або іншій сфері прямої комунікації. Якщо це Ти — тоді надсилай своє резюме!
    
    Чим ми займаємось?
    
    Організація внутрішніх та міжнародних перевезень усіх типів вантажів;
    Робота з контрагентами по забезпеченню їх транспортом та підтримання ділових відносин на довгострокову перспективу;
    Оперативний пошук транспорту для перевезення вантажів та підтримування ділових відносин з перевізником;
    Контроль перевезення вантажу на усіх етапах;
    Документальний супровід.
    Що нам важливо у тобі в межах цієї позиції?
    
    Досвіду в побудові та розвитку тривалих відносин з клієнтами та партнерами;
    Вміння домовлятись та будувати довготермінові партнерські відносини;
    Відповідальність, чіткість і послідовність в роботі;
    Логічне мислення та комунікабельність та порядність;
    Здатність працювати самостійно та одночасно бути продуктивним командним гравцем.
    Що ми пропонуємо?
    
    Офіційне працевлаштування;
    Підтримку в навчанні та плачуваний період стажування;
    Ставка + відсоток або великий % на вибір!
    Прозоре нарахування заробітної плати, вчасну її виплату;
    Графік роботи (пн-чт) 9:00—18:00, (пт) 9:00—17:00.
    Що ти прокачаєш?
    
    Навички будуватимеш стратегічні відносини з партнерами;
    Командну роботу. Ми знаємо, що створення якісних проектів, можливо лише в тісній співпраці всередині компанії;
    Вміння швидко занурюватися в проблему та знаходити рішення.`,
    salary: 20000,
    experience: 5,
    education: 'бакалавр' as const,
    location: 'Київ',
    contract: 'повна' as const,
  },
];

const Home = () => {
  return (
    <>
      <VacancySearch />
      <Container>
        {/* <VacancyFilters /> */}
        <VacancyCardList vacancies={data} />
      </Container>
    </>
  );
};

export default Home;
